# 1.Series

In [111]:
import numpy as np
import pandas as pd
from numpy.random import randn
from pandas import Series,DataFrame

In [85]:
obj = Series([10,20,30,40,50,60])
obj

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64

In [86]:
obj.values

array([10, 20, 30, 40, 50, 60])

In [87]:
obj.index

RangeIndex(start=0, stop=6, step=1)

In [88]:
classname = ['Taro','Jiro','Hanako','Maki']
height = Series([174,167,151,169],index=classname)
height

Taro      174
Jiro      167
Hanako    151
Maki      169
dtype: int64

In [89]:
height.name = 'height'
height.index.name = 'name'
height

name
Taro      174
Jiro      167
Hanako    151
Maki      169
Name: height, dtype: int64

In [90]:
pd.notnull(height)

name
Taro      True
Jiro      True
Hanako    True
Maki      True
Name: height, dtype: bool

# 2.Dataframe

In [91]:
saigaihaken = pd.read_clipboard()

In [92]:
saigaihaken

         要請日時    要請元             要請先       要請内容        撤収日時
0   7月6日1時10分  京都府知事   陸上自衛隊第7普通科連隊長       水防活動    7月6日7時5分
1   7月6日3時30分  高知県知事  陸上自衛隊第50普通科連隊長    孤立者の救助等         NaN
2   7月6日9時56分  福岡県知事      陸上自衛隊第4師団長       人命救助         NaN
3  7月6日18時35分  京都府知事   陸上自衛隊第7普通科連隊長  水防活動（再要請）  7月6日23時30分
4  7月6日21時00分  広島県知事     陸上自衛隊第13旅団長       人命救助         NaN
5  7月6日23時11分  岡山県知事     陸上自衛隊第13旅団長      人命救助等         NaN

In [93]:
#columns 列の名前を取得
saigaihaken.columns

Index(['要請日時', '要請元', '要請先', '要請内容', '撤収日時'], dtype='object')

In [94]:
#列のデータを取得
saigaihaken["要請日時"]

0     7月6日1時10分
1     7月6日3時30分
2     7月6日9時56分
3    7月6日18時35分
4    7月6日21時00分
5    7月6日23時11分
Name: 要請日時, dtype: object

In [95]:
#オブジェクトの属性のような書き方も可能」
saigaihaken.要請日時

0     7月6日1時10分
1     7月6日3時30分
2     7月6日9時56分
3    7月6日18時35分
4    7月6日21時00分
5    7月6日23時11分
Name: 要請日時, dtype: object

In [96]:
saigaihaken2 = DataFrame(saigaihaken, columns=['要請日時','要請内容'])
saigaihaken2

         要請日時       要請内容
0   7月6日1時10分       水防活動
1   7月6日3時30分    孤立者の救助等
2   7月6日9時56分       人命救助
3  7月6日18時35分  水防活動（再要請）
4  7月6日21時00分       人命救助
5  7月6日23時11分      人命救助等

In [97]:
saigaihaken2.head(2)

        要請日時     要請内容
0  7月6日1時10分     水防活動
1  7月6日3時30分  孤立者の救助等

In [98]:
saigaihaken2.tail(2)

         要請日時   要請内容
4  7月6日21時00分   人命救助
5  7月6日23時11分  人命救助等

In [99]:
#行の取り出し
saigaihaken2.loc[3]

要請日時    7月6日18時35分
要請内容     水防活動（再要請）
Name: 3, dtype: object

In [100]:
junjo = np.arange(6)
junjo

array([0, 1, 2, 3, 4, 5])

In [101]:
saigaihaken2['順序'] = junjo

In [102]:
saigaihaken2

         要請日時       要請内容  順序
0   7月6日1時10分       水防活動   0
1   7月6日3時30分    孤立者の救助等   1
2   7月6日9時56分       人命救助   2
3  7月6日18時35分  水防活動（再要請）   3
4  7月6日21時00分       人命救助   4
5  7月6日23時11分      人命救助等   5

In [103]:
del saigaihaken2['順序']

# 3.index

In [104]:
#Seriesを定義
series1 = Series([10,20,30,40], index=[0,1,2,3])
series1

0    10
1    20
2    30
3    40
dtype: int64

In [105]:
#SeriesからIndexを抜き出す
index1 = series1.index
index1

Int64Index([0, 1, 2, 3], dtype='int64')

In [106]:
#indexの要素を取り出す
index1[2]

2

In [107]:
series2 = series1.reindex(['A','B','C','D'])
series2

A   NaN
B   NaN
C   NaN
D   NaN
dtype: float64

In [128]:
#ランダムな数のDataFrameを作成
randframe = DataFrame(randn(15).reshape((3,5)), index=['A','B','D'], columns=['col1','col2','col3','col4','col5'])
randframe

       col1      col2      col3      col4      col5
A  0.911156  1.791677 -0.002518  0.731693 -0.555693
B -1.556093  1.150889  0.162026 -1.748506 -0.082825
D  0.688904 -2.581046  0.001189  1.179258 -1.338308

In [129]:
#新しい行のindexを追加
new_index = ['A','B','C','D']
randframe2 = randframe.reindex(new_index, fill_value=0)
randframe2

       col1      col2      col3      col4      col5
A  0.911156  1.791677 -0.002518  0.731693 -0.555693
B -1.556093  1.150889  0.162026 -1.748506 -0.082825
C  0.000000  0.000000  0.000000  0.000000  0.000000
D  0.688904 -2.581046  0.001189  1.179258 -1.338308

In [130]:
#新しい列を追加
new_columns = ['col1','col2','col3','col4','col5','col6']
randframe2 = randframe2.reindex(columns=new_columns)
randframe2

       col1      col2      col3      col4      col5  col6
A  0.911156  1.791677 -0.002518  0.731693 -0.555693   NaN
B -1.556093  1.150889  0.162026 -1.748506 -0.082825   NaN
C  0.000000  0.000000  0.000000  0.000000  0.000000   NaN
D  0.688904 -2.581046  0.001189  1.179258 -1.338308   NaN

In [136]:
#行、列を同時に追加
randframe3 = randseries.reindex(new_index, columns=new_columns)
randframe3

       col1      col2      col3      col4      col5  col6
A  0.317271  0.364395 -0.567587 -1.247883 -0.078857   NaN
B  0.841165 -0.752094 -2.978104 -0.939775  0.944602   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D -1.012425  0.807002 -0.352040  0.998138  1.737926   NaN

In [138]:
#Series1を定義
series1 = Series(np.arange(4), index=['a','b','c','d'])
series1

a    0
b    1
c    2
d    3
dtype: int64

In [139]:
#Seriesの行を削除
series1.drop('a')

b    1
c    2
d    3
dtype: int64

In [167]:
#Dataframe1を定義
dataframe1 = DataFrame(np.arange(9).reshape((3,3)), index=['JPN','USA','EU'], columns=['gdp','pop','landarea'])
dataframe1

     gdp  pop  landarea
JPN    0    1         2
USA    3    4         5
EU     6    7         8

In [168]:
#行を削除
dataframe1.drop('EU', axis=0)

     gdp  pop  landarea
JPN    0    1         2
USA    3    4         5

In [169]:
#列を削除
dataframe1.drop('landarea',axis=1)

     gdp  pop
JPN    0    1
USA    3    4
EU     6    7

     gdp  pop
JPN    0    1
USA    3    4